# EnergyAnalysisWindowType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisWindowType Class
Members See Also
---
The EnergyAnalysisWindowType class contains window type data for gbXml export.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class EnergyAnalysisWindowType : Element
```

Visual Basic
---
```text
Public Class EnergyAnalysisWindowType _
	Inherits Element
```

Visual C++
---
```text
public ref class EnergyAnalysisWindowType : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Analysis..::..EnergyAnalysisWindowType
# See Also
EnergyAnalysisWindowType Members
Autodesk.Revit.DB.Analysis Namespace